---
kind: type
id: T:Autodesk.Revit.UI.SplitButtonData
source: html/c0c2c690-981b-135b-670e-f1803d1e892e.htm
---
# Autodesk.Revit.UI.SplitButtonData

This class contains information necessary to construct a split button in the Ribbon.

## Syntax (C#)
```csharp
public class SplitButtonData : PulldownButtonData
```